cases/bioGrowthTwoPhase2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.22";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
9137
(
(0.074342791 0.015965511 0)
(0.065463722 0.012362582 0)
(0.050516429 0.0064271484 0)
(0.043411992 0.0024751126 0)
(0.042277647 0.00033726635 0)
(0.043824053 -0.00059917848 0)
(0.04622284 -0.00074516058 0)
(0.047431458 -0.00020588901 0)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
70
(
(0.1797685 -0.023656152 0)
(0.31068867 -0.079966962 0)
(0.35802043 -0.15254642 0)
(0.36767443 -0.22218998 0)
(0.35885947 -0.28365586 0)
(0.34119745 -0.33560475 0)
(0.31942044 -0.37815636 0)
(0.29586304 -0.41217144 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    movingWalls_patch0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
