cases/bioGrowthTwoPhase2/0/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.22";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9137
(
5.1562935e-77
2.9811232e-58
7.2126162e-52
3.7130342e-31
-4.2062154e-27
-3.5886133e-25
-9.5841846e-25
-1.1734031e-25
...
)
;

boundaryField
{
    walls
    {
        type            constantAlphaContactAngle;
        gradient        nonuniform List<scalar> 
196
(
0.0001591
0.0012177919
0.010698182
0.093802607
0.82249012
7.2118449
63.235669
554.46981
...
)
;
        limit           gradient;
        theta0          0;
        value           nonuniform List<scalar> 
196
(
3.182e-10
2.4355837e-09
2.1396364e-08
1.8760521e-07
1.6449802e-06
1.442369e-05
0.00012647134
0.0011089396
...
)
;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           nonuniform List<scalar> 
70
(
0.012377985
2.0043227e-06
3.3169328e-06
1.5616016e-05
2.853956e-05
8.544196e-06
4.3338867e-06
8.116451e-06
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    movingWalls_patch0
    {
        type            constantAlphaContactAngle;
        gradient        nonuniform List<scalar> 
2568
(
0.3802653
4553.5011
62074.837
33.350974
0.042946021
328507.22
7124.0273
149927.26
...
)
;
        limit           gradient;
        theta0          0;
        value           nonuniform List<scalar> 
2568
(
1
0.00853665
1
1
1
0.50650447
0.98910588
0.74030186
...
)
;
    }
}


// ************************************************************************* //
