cases/bioGrowthTwoPhase2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.22";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
9137
(
8223.999
8189.0163
8175.1359
8168.5254
8163.2458
8158.0868
8152.3286
8145.6565
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
196
(
8223.999
8189.0163
8175.1359
8168.5254
8163.2458
8158.0868
8152.3286
8145.6565
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
70
(
8223.999
8192.5521
8180.0211
8173.9448
8171.7525
8172.1749
8174.6402
8178.8313
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
70
(
-3071.0572
-3070.5486
-3069.2998
-3067.3892
-3064.9745
-3062.1974
-3059.1561
-3055.902
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    movingWalls_patch0
    {
        type            calculated;
        value           nonuniform List<scalar> 
2568
(
-8578.7566
8104.8692
517.67364
-4479.8068
-3865.1594
4486.8015
-2795.6508
5520.8683
...
)
;
    }
}


// ************************************************************************* //
