cases/bioGrowthTwoPhase2/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0.22";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
16822
(
6.0270825e-12
1.9729175e-12
4.4892905e-12
1.537792e-12
3.6839021e-12
8.0538843e-13
3.4093973e-12
2.7450484e-13
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform -8e-12;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
70
(
1.4621297e-11
2.5077289e-11
2.8852399e-11
2.9604792e-11
2.8870649e-11
2.7426019e-11
2.5654411e-11
2.3744523e-11
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    movingWalls_patch0
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
