cases/bioGrowthTwoPhase2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 1 
    volScalarFieldValue T 0
);

regions
(
    boxToCell
    {
        box (-0.00046 -2e-3 -1e-3) (-0.0004 2e-3 1e-3);

        fieldValues
        (
            volScalarFieldValue alpha1 0 
            volScalarFieldValue T 1
        );
    }
);


// ************************************************************************* //
